Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput Constructor
 Initializes a new instance of the PluginPickerInput class with an empty list of picker inputs.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginPickerInput()
Public Sub New
See Also
Reference
PluginPickerInput Class
PluginPickerInput Overload
Tekla.Structures.Drawing Namespace